; domain
(define (domain piwnica-puzzle)
  (:requirements :strips :typing :negative-preconditions)
  (:types tile position room kolor kulkaid)

  (:predicates
    ;; Piwnica
    (kulka ?id - kulkaid ?color - kolor ?room - room)
    (drzwi ?from - room ?to - room ?color - kolor)
    (ludzik ?room - room)
    (trzymam ?color - kolor ?id - kulkaid)

    ;; 8-puzzle
    (at ?t - tile ?p - position)
    (empty ?p - position)
    (adjacent ?p1 - position ?p2 - position)
  )

  (:action wez
    :parameters (?color - kolor ?id - kulkaid ?room - room)
    :precondition (and
      (ludzik ?room)
      (kulka ?id ?color ?room)
      (not (trzymam ?color ?id))
    )
    :effect (and
      (not (kulka ?id ?color ?room))
      (trzymam ?color ?id)
    )
  )

  (:action idz
    :parameters (?to - room ?from - room ?color - kolor ?id - kulkaid)
    :precondition (and
      (ludzik ?from)
      (drzwi ?from ?to ?color)
      (trzymam ?color ?id)
    )
    :effect (and
      (not (ludzik ?from))
      (not (trzymam ?color ?id))
      (ludzik ?to)
    )
  )

  (:action przesun
    :parameters (?t - tile ?from - position ?to - position)
    :precondition (and
      (ludzik a)
      (at ?t ?from)
      (empty ?to)
      (adjacent ?from ?to)
    )
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
      (not (empty ?to))
      (empty ?from)
    )
  )
)

; problem
(define (problem piwnica-puzzle-instance)
  (:domain piwnica-puzzle)

  (:objects
    ;; Rooms
    a b c d e f g h i - room

    ;; Colors
    zielony czerwony pomaranczowy rozowy niebieski - kolor

    ;; Kulki
    k1 k2 k3 k4 k5 k6 k7 k8 k9 k10 k11 k12 k13 k14 - kulkaid

    ;; Puzzle tiles
    t1 t2 t3 t4 t5 t6 t7 t8 - tile
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - position
  )

  (:init
    ;; Kulki locations
    (kulka k1 zielony a)
    (kulka k2 rozowy b)
    (kulka k3 pomaranczowy c)
    (kulka k4 niebieski c)
    (kulka k5 zielony d)
    (kulka k6 czerwony d)
    (kulka k7 niebieski e)
    (kulka k8 zielony e)
    (kulka k9 niebieski f)
    (kulka k10 niebieski f)
    (kulka k11 zielony h)
    (kulka k12 czerwony h)
    (kulka k13 pomaranczowy i)
    (kulka k14 niebieski i)

    ;; Doors
    (drzwi a b pomaranczowy)
    (drzwi a c czerwony)
    (drzwi c a czerwony)
    (drzwi b d pomaranczowy)
    (drzwi c e zielony)
    (drzwi e c zielony)
    (drzwi d f zielony)
    (drzwi f d zielony)
    (drzwi e f niebieski)
    (drzwi f e niebieski)
    (drzwi f g rozowy)
    (drzwi e h czerwony)
    (drzwi h e czerwony)
    (drzwi h i niebieski)
    (drzwi i h niebieski)
    (drzwi i f niebieski)
    (drzwi f i niebieski)

    ;; Ludzik start
    (ludzik f)

    ;; 8-puzzle init
    (at t5 p1)
    (at t4 p2)
    (at t1 p3)
    (at t8 p4)
    (empty p5)
    (at t3 p6)
    (at t7 p7)
    (at t2 p8)
    (at t6 p9)

    ;; Adjacency of 8-puzzle tiles
    (adjacent p1 p2) (adjacent p2 p1)
    (adjacent p2 p3) (adjacent p3 p2)
    (adjacent p1 p4) (adjacent p4 p1)
    (adjacent p2 p5) (adjacent p5 p2)
    (adjacent p3 p6) (adjacent p6 p3)
    (adjacent p4 p5) (adjacent p5 p4)
    (adjacent p5 p6) (adjacent p6 p5)
    (adjacent p4 p7) (adjacent p7 p4)
    (adjacent p5 p8) (adjacent p8 p5)
    (adjacent p6 p9) (adjacent p9 p6)
    (adjacent p7 p8) (adjacent p8 p7)
    (adjacent p8 p9) (adjacent p9 p8)
  )

  (:goal (and
    ;; Ludzik must reach room g
    (ludzik g)

    ;; 8-puzzle must be solved:
    ;; 1 2 3
    ;; 4 5 6
    ;; 7 8 _
    (at t1 p1)
    (at t2 p2)
    (at t3 p3)
    (at t4 p4)
    (at t5 p5)
    (at t6 p6)
    (at t7 p7)
    (at t8 p8)
    (empty p9)
  )
  )
)

; plan
1. (wez niebieski k10 f)
   deleted: (kulka k10 niebieski f)
   added: (trzymam niebieski k10)
   goals met: 1 of 10
2. (idz i f niebieski k10)
   deleted: (ludzik f) (trzymam niebieski k10)
   added: (ludzik i)
   goals met: 1 of 10
3. (wez niebieski k14 i)
   deleted: (kulka k14 niebieski i)
   added: (trzymam niebieski k14)
   goals met: 1 of 10
4. (wez pomaranczowy k13 i)
   deleted: (kulka k13 pomaranczowy i)
   added: (trzymam pomaranczowy k13)
   goals met: 1 of 10
5. (idz h i niebieski k14)
   deleted: (ludzik i) (trzymam niebieski k14)
   added: (ludzik h)
   goals met: 1 of 10
6. (wez czerwony k12 h)
   deleted: (kulka k12 czerwony h)
   added: (trzymam czerwony k12)
   goals met: 1 of 10
7. (wez zielony k11 h)
   deleted: (kulka k11 zielony h)
   added: (trzymam zielony k11)
   goals met: 1 of 10
8. (idz e h czerwony k12)
   deleted: (ludzik h) (trzymam czerwony k12)
   added: (ludzik e)
   goals met: 1 of 10
9. (wez niebieski k7 e)
   deleted: (kulka k7 niebieski e)
   added: (trzymam niebieski k7)
   goals met: 1 of 10
10. (idz f e niebieski k7)
   deleted: (ludzik e) (trzymam niebieski k7)
   added: (ludzik f)
   goals met: 1 of 10
11. (wez niebieski k9 f)
   deleted: (kulka k9 niebieski f)
   added: (trzymam niebieski k9)
   goals met: 1 of 10
12. (idz d f zielony k11)
   deleted: (ludzik f) (trzymam zielony k11)
   added: (ludzik d)
   goals met: 1 of 10
13. (wez zielony k5 d)
   deleted: (kulka k5 zielony d)
   added: (trzymam zielony k5)
   goals met: 1 of 10
14. (wez czerwony k6 d)
   deleted: (kulka k6 czerwony d)
   added: (trzymam czerwony k6)
   goals met: 1 of 10
15. (idz f d zielony k5)
   deleted: (ludzik d) (trzymam zielony k5)
   added: (ludzik f)
   goals met: 1 of 10
16. (idz e f niebieski k9)
   deleted: (ludzik f) (trzymam niebieski k9)
   added: (ludzik e)
   goals met: 1 of 10
17. (wez zielony k8 e)
   deleted: (kulka k8 zielony e)
   added: (trzymam zielony k8)
   goals met: 1 of 10
18. (idz c e zielony k8)
   deleted: (ludzik e) (trzymam zielony k8)
   added: (ludzik c)
   goals met: 1 of 10
19. (wez pomaranczowy k3 c)
   deleted: (kulka k3 pomaranczowy c)
   added: (trzymam pomaranczowy k3)
   goals met: 1 of 10
20. (idz a c czerwony k6)
   deleted: (ludzik c) (trzymam czerwony k6)
   added: (ludzik a)
   goals met: 1 of 10
21. (przesun t8 p4 p5)
   deleted: (at t8 p4) (empty p5)
   added: (at t8 p5) (empty p4)
   goals met: 1 of 10
22. (przesun t7 p7 p4)
   deleted: (at t7 p7) (empty p4)
   added: (at t7 p4) (empty p7)
   goals met: 0 of 10
23. (przesun t2 p8 p7)
   deleted: (at t2 p8) (empty p7)
   added: (at t2 p7) (empty p8)
   goals met: 0 of 10
24. (przesun t8 p5 p8)
   deleted: (at t8 p5) (empty p8)
   added: (at t8 p8) (empty p5)
   goals met: 1 of 10
25. (przesun t4 p2 p5)
   deleted: (at t4 p2) (empty p5)
   added: (at t4 p5) (empty p2)
   goals met: 1 of 10
26. (przesun t5 p1 p2)
   deleted: (at t5 p1) (empty p2)
   added: (at t5 p2) (empty p1)
   goals met: 1 of 10
27. (przesun t7 p4 p1)
   deleted: (at t7 p4) (empty p1)
   added: (at t7 p1) (empty p4)
   goals met: 1 of 10
28. (przesun t4 p5 p4)
   deleted: (at t4 p5) (empty p4)
   added: (at t4 p4) (empty p5)
   goals met: 2 of 10
29. (przesun t5 p2 p5)
   deleted: (at t5 p2) (empty p5)
   added: (at t5 p5) (empty p2)
   goals met: 3 of 10
30. (przesun t1 p3 p2)
   deleted: (at t1 p3) (empty p2)
   added: (at t1 p2) (empty p3)
   goals met: 3 of 10
31. (przesun t3 p6 p3)
   deleted: (at t3 p6) (empty p3)
   added: (at t3 p3) (empty p6)
   goals met: 4 of 10
32. (przesun t6 p9 p6)
   deleted: (at t6 p9) (empty p6)
   added: (at t6 p6) (empty p9)
   goals met: 6 of 10
33. (wez zielony k1 a)
   deleted: (kulka k1 zielony a)
   added: (trzymam zielony k1)
   goals met: 6 of 10
34. (przesun t8 p8 p9)
   deleted: (at t8 p8) (empty p9)
   added: (at t8 p9) (empty p8)
   goals met: 4 of 10
35. (przesun t2 p7 p8)
   deleted: (at t2 p7) (empty p8)
   added: (at t2 p8) (empty p7)
   goals met: 4 of 10
36. (przesun t4 p4 p7)
   deleted: (at t4 p4) (empty p7)
   added: (at t4 p7) (empty p4)
   goals met: 3 of 10
37. (przesun t7 p1 p4)
   deleted: (at t7 p1) (empty p4)
   added: (at t7 p4) (empty p1)
   goals met: 3 of 10
38. (przesun t1 p2 p1)
   deleted: (at t1 p2) (empty p1)
   added: (at t1 p1) (empty p2)
   goals met: 4 of 10
39. (przesun t5 p5 p2)
   deleted: (at t5 p5) (empty p2)
   added: (at t5 p2) (empty p5)
   goals met: 3 of 10
40. (przesun t2 p8 p5)
   deleted: (at t2 p8) (empty p5)
   added: (at t2 p5) (empty p8)
   goals met: 3 of 10
41. (przesun t4 p7 p8)
   deleted: (at t4 p7) (empty p8)
   added: (at t4 p8) (empty p7)
   goals met: 3 of 10
42. (przesun t7 p4 p7)
   deleted: (at t7 p4) (empty p7)
   added: (at t7 p7) (empty p4)
   goals met: 4 of 10
43. (przesun t2 p5 p4)
   deleted: (at t2 p5) (empty p4)
   added: (at t2 p4) (empty p5)
   goals met: 4 of 10
44. (przesun t5 p2 p5)
   deleted: (at t5 p2) (empty p5)
   added: (at t5 p5) (empty p2)
   goals met: 5 of 10
45. (przesun t3 p3 p2)
   deleted: (at t3 p3) (empty p2)
   added: (at t3 p2) (empty p3)
   goals met: 4 of 10
46. (przesun t6 p6 p3)
   deleted: (at t6 p6) (empty p3)
   added: (at t6 p3) (empty p6)
   goals met: 3 of 10
47. (przesun t8 p9 p6)
   deleted: (at t8 p9) (empty p6)
   added: (at t8 p6) (empty p9)
   goals met: 4 of 10
48. (przesun t4 p8 p9)
   deleted: (at t4 p8) (empty p9)
   added: (at t4 p9) (empty p8)
   goals met: 3 of 10
49. (przesun t5 p5 p8)
   deleted: (at t5 p5) (empty p8)
   added: (at t5 p8) (empty p5)
   goals met: 2 of 10
50. (przesun t8 p6 p5)
   deleted: (at t8 p6) (empty p5)
   added: (at t8 p5) (empty p6)
   goals met: 2 of 10
51. (przesun t4 p9 p6)
   deleted: (at t4 p9) (empty p6)
   added: (at t4 p6) (empty p9)
   goals met: 3 of 10
52. (przesun t5 p8 p9)
   deleted: (at t5 p8) (empty p9)
   added: (at t5 p9) (empty p8)
   goals met: 2 of 10
53. (przesun t8 p5 p8)
   deleted: (at t8 p5) (empty p8)
   added: (at t8 p8) (empty p5)
   goals met: 3 of 10
54. (przesun t4 p6 p5)
   deleted: (at t4 p6) (empty p5)
   added: (at t4 p5) (empty p6)
   goals met: 3 of 10
55. (przesun t6 p3 p6)
   deleted: (at t6 p3) (empty p6)
   added: (at t6 p6) (empty p3)
   goals met: 4 of 10
56. (przesun t3 p2 p3)
   deleted: (at t3 p2) (empty p3)
   added: (at t3 p3) (empty p2)
   goals met: 5 of 10
57. (przesun t4 p5 p2)
   deleted: (at t4 p5) (empty p2)
   added: (at t4 p2) (empty p5)
   goals met: 5 of 10
58. (przesun t2 p4 p5)
   deleted: (at t2 p4) (empty p5)
   added: (at t2 p5) (empty p4)
   goals met: 5 of 10
59. (przesun t1 p1 p4)
   deleted: (at t1 p1) (empty p4)
   added: (at t1 p4) (empty p1)
   goals met: 4 of 10
60. (przesun t4 p2 p1)
   deleted: (at t4 p2) (empty p1)
   added: (at t4 p1) (empty p2)
   goals met: 4 of 10
61. (przesun t2 p5 p2)
   deleted: (at t2 p5) (empty p2)
   added: (at t2 p2) (empty p5)
   goals met: 5 of 10
62. (przesun t8 p8 p5)
   deleted: (at t8 p8) (empty p5)
   added: (at t8 p5) (empty p8)
   goals met: 4 of 10
63. (przesun t7 p7 p8)
   deleted: (at t7 p7) (empty p8)
   added: (at t7 p8) (empty p7)
   goals met: 3 of 10
64. (przesun t1 p4 p7)
   deleted: (at t1 p4) (empty p7)
   added: (at t1 p7) (empty p4)
   goals met: 3 of 10
65. (przesun t8 p5 p4)
   deleted: (at t8 p5) (empty p4)
   added: (at t8 p4) (empty p5)
   goals met: 3 of 10
66. (przesun t7 p8 p5)
   deleted: (at t7 p8) (empty p5)
   added: (at t7 p5) (empty p8)
   goals met: 3 of 10
67. (przesun t1 p7 p8)
   deleted: (at t1 p7) (empty p8)
   added: (at t1 p8) (empty p7)
   goals met: 3 of 10
68. (przesun t8 p4 p7)
   deleted: (at t8 p4) (empty p7)
   added: (at t8 p7) (empty p4)
   goals met: 3 of 10
69. (przesun t4 p1 p4)
   deleted: (at t4 p1) (empty p4)
   added: (at t4 p4) (empty p1)
   goals met: 4 of 10
70. (przesun t2 p2 p1)
   deleted: (at t2 p2) (empty p1)
   added: (at t2 p1) (empty p2)
   goals met: 3 of 10
71. (przesun t7 p5 p2)
   deleted: (at t7 p5) (empty p2)
   added: (at t7 p2) (empty p5)
   goals met: 3 of 10
72. (przesun t1 p8 p5)
   deleted: (at t1 p8) (empty p5)
   added: (at t1 p5) (empty p8)
   goals met: 3 of 10
73. (przesun t8 p7 p8)
   deleted: (at t8 p7) (empty p8)
   added: (at t8 p8) (empty p7)
   goals met: 4 of 10
74. (przesun t4 p4 p7)
   deleted: (at t4 p4) (empty p7)
   added: (at t4 p7) (empty p4)
   goals met: 3 of 10
75. (przesun t1 p5 p4)
   deleted: (at t1 p5) (empty p4)
   added: (at t1 p4) (empty p5)
   goals met: 3 of 10
76. (przesun t7 p2 p5)
   deleted: (at t7 p2) (empty p5)
   added: (at t7 p5) (empty p2)
   goals met: 3 of 10
77. (przesun t2 p1 p2)
   deleted: (at t2 p1) (empty p2)
   added: (at t2 p2) (empty p1)
   goals met: 4 of 10
78. (przesun t1 p4 p1)
   deleted: (at t1 p4) (empty p1)
   added: (at t1 p1) (empty p4)
   goals met: 5 of 10
79. (przesun t4 p7 p4)
   deleted: (at t4 p7) (empty p4)
   added: (at t4 p4) (empty p7)
   goals met: 6 of 10
80. (przesun t8 p8 p7)
   deleted: (at t8 p8) (empty p7)
   added: (at t8 p7) (empty p8)
   goals met: 5 of 10
81. (przesun t7 p5 p8)
   deleted: (at t7 p5) (empty p8)
   added: (at t7 p8) (empty p5)
   goals met: 5 of 10
82. (przesun t6 p6 p5)
   deleted: (at t6 p6) (empty p5)
   added: (at t6 p5) (empty p6)
   goals met: 4 of 10
83. (przesun t5 p9 p6)
   deleted: (at t5 p9) (empty p6)
   added: (at t5 p6) (empty p9)
   goals met: 5 of 10
84. (przesun t7 p8 p9)
   deleted: (at t7 p8) (empty p9)
   added: (at t7 p9) (empty p8)
   goals met: 4 of 10
85. (przesun t6 p5 p8)
   deleted: (at t6 p5) (empty p8)
   added: (at t6 p8) (empty p5)
   goals met: 4 of 10
86. (przesun t5 p6 p5)
   deleted: (at t5 p6) (empty p5)
   added: (at t5 p5) (empty p6)
   goals met: 5 of 10
87. (przesun t7 p9 p6)
   deleted: (at t7 p9) (empty p6)
   added: (at t7 p6) (empty p9)
   goals met: 6 of 10
88. (przesun t6 p8 p9)
   deleted: (at t6 p8) (empty p9)
   added: (at t6 p9) (empty p8)
   goals met: 5 of 10
89. (przesun t8 p7 p8)
   deleted: (at t8 p7) (empty p8)
   added: (at t8 p8) (empty p7)
   goals met: 6 of 10
90. (przesun t4 p4 p7)
   deleted: (at t4 p4) (empty p7)
   added: (at t4 p7) (empty p4)
   goals met: 5 of 10
91. (przesun t5 p5 p4)
   deleted: (at t5 p5) (empty p4)
   added: (at t5 p4) (empty p5)
   goals met: 4 of 10
92. (przesun t7 p6 p5)
   deleted: (at t7 p6) (empty p5)
   added: (at t7 p5) (empty p6)
   goals met: 4 of 10
93. (przesun t6 p9 p6)
   deleted: (at t6 p9) (empty p6)
   added: (at t6 p6) (empty p9)
   goals met: 6 of 10
94. (przesun t8 p8 p9)
   deleted: (at t8 p8) (empty p9)
   added: (at t8 p9) (empty p8)
   goals met: 4 of 10
95. (przesun t7 p5 p8)
   deleted: (at t7 p5) (empty p8)
   added: (at t7 p8) (empty p5)
   goals met: 4 of 10
96. (przesun t5 p4 p5)
   deleted: (at t5 p4) (empty p5)
   added: (at t5 p5) (empty p4)
   goals met: 5 of 10
97. (przesun t4 p7 p4)
   deleted: (at t4 p7) (empty p4)
   added: (at t4 p4) (empty p7)
   goals met: 6 of 10
98. (przesun t7 p8 p7)
   deleted: (at t7 p8) (empty p7)
   added: (at t7 p7) (empty p8)
   goals met: 7 of 10
99. (przesun t8 p9 p8)
   deleted: (at t8 p9) (empty p8)
   added: (at t8 p8) (empty p9)
   goals met: 9 of 10
100. (idz b a pomaranczowy k3)
   deleted: (ludzik a) (trzymam pomaranczowy k3)
   added: (ludzik b)
   goals met: 9 of 10
101. (wez rozowy k2 b)
   deleted: (kulka k2 rozowy b)
   added: (trzymam rozowy k2)
   goals met: 9 of 10
102. (idz d b pomaranczowy k13)
   deleted: (ludzik b) (trzymam pomaranczowy k13)
   added: (ludzik d)
   goals met: 9 of 10
103. (idz f d zielony k1)
   deleted: (ludzik d) (trzymam zielony k1)
   added: (ludzik f)
   goals met: 9 of 10
104. (idz g f rozowy k2)
   deleted: (ludzik f) (trzymam rozowy k2)
   added: (ludzik g)
   goals met: 10 of 10
